app/views/slots/show.html.erb

  <ul>
    <% @slot.clients.each do |client| %>
---
SELECT "clients".* FROM "clients" INNER JOIN "enrollments" ON "clients"."id" = "enrollments"."client_id" WHERE "enrollments"."slot_id" = ?  [["slot_id", 1]]