app/views/calendar_days/show.html.erb

<ul>
  <% @calendar_day.slots.each do |slot| %>
---
SELECT "slots".* FROM "slots" WHERE "slots"."day" = ? AND "slots"."day" = ?  [["day", "2024-01-01"], ["day", "Monday"]]