app/views/turmas/show.html.erb

SELECT "clients".* FROM "clients" INNER JOIN "enrollments" ON "clients"."id" = "enrollments"."client_id" WHERE "enrollments"."turma_id" = ?  [["turma_id", 1]]
---
  <ul>
    <% @turma.clients.each do |client| %>