app/views/groups/_form.html.erb

    <%= form.label :professor_titular_id, "Professor Titular" %>
    <%= form.collection_select :professor_titular_id, Employee.all, :id, :name, prompt: "Selecione um professor" %>
---
SELECT "employees".* FROM "employees"