app/views/groups/show.html.erb

SELECT "clients".* FROM "clients" INNER JOIN "enrollments" ON "clients"."id" = "enrollments"."client_id" WHERE "enrollments"."group_id" = ?  [["group_id", 21]]
---
  <tbody>
    <% @group.clients.each do |client| %>