app/views/clients/_form.html.erb

SELECT "groups".* FROM "groups"
---
    <%= form.label :group_ids, "Turmas" %>
    <%= form.collection_select :group_ids, Group.all, :id, :display_name, {}, { multiple: true } %>