app/views/clients/show.html.erb

SELECT "groups".* FROM "groups" INNER JOIN "enrollments" ON "groups"."id" = "enrollments"."group_id" WHERE "enrollments"."client_id" = ?  [["client_id", 1]]
---
<ul>
  <% @client.groups.each do |group| %>