app/controllers/aulas_controller.rb

  def edit
    @aula = Aula.find(params[:id])
---
SELECT "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @aula = Aula.find(params[:id])
    if @aula.update(aula_params)
---
SELECT "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "aulas" SET "updated_at" = ?, "tecnico" = ? WHERE "aulas"."id" = ?