app/controllers/aulas_controller.rb

SELECT "aulas".* FROM "aulas"
---
  def index
    @aulas = Aula.all

SELECT "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @aula = Aula.find(params[:id])

SELECT "aquecimentos".* FROM "aquecimentos" WHERE "aquecimentos"."aula_id" = ? LIMIT ?  [["aula_id", 3], ["LIMIT", 1]]
INSERT INTO "aquecimentos" ("articular", "cardio", "tecnico", "aula_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "aulas" ("data", "conteudo", "objetivo", "created_at", "updated_at", "aquecimento", "tecnico", "fisico") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @aula = Aula.new(aula_params)
    @aula.aquecimento ||= {"articular" => "", "cardio" => "", "tecnico" => ""}
    @aula.data = Date.strptime(params[:aula][:data], '%d/%m/%Y') if params[:aula][:data].present?
    if @aula.save

SELECT "aulas".* FROM "aulas" WHERE "aulas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    @aula = Aula.find(params[:id])