app/controllers/calendar_days_controller.rb

  def show
    @calendar = @calendar_day.calendar
    translated_day = translate_day(@calendar_day.date.strftime("%A"))
    @groups = Group.where(day: translated_day)
---
SELECT "groups".* FROM "groups" WHERE "groups"."day" = ?  [["day", "Segunda-Feira"]]

  def set_calendar_day
    @calendar_day = CalendarDay.find(params[:id])
---
SELECT "calendar_days".* FROM "calendar_days" WHERE "calendar_days"."id" = ? LIMIT ?  [["id", 732], ["LIMIT", 1]]