app/controllers/calendars_controller.rb

SELECT "calendars".* FROM "calendars"
---
  def index
    @calendars = Calendar.all

SELECT "calendar_days".* FROM "calendar_days" WHERE "calendar_days"."calendar_id" = ? ORDER BY "calendar_days"."date" ASC  [["calendar_id", 2]]
---
def show
  @calendar_days = @calendar.calendar_days.order(:date)

INSERT INTO "calendars" ("year", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["year", 2023], ["created_at", "2024-08-06 22:57:19.620077"], ["updated_at", "2024-08-06 22:57:19.620077"]]
---
def create
  @calendar = Calendar.new(calendar_params)

  respond_to do |format|
    if @calendar.save

DELETE FROM "calendars" WHERE "calendars"."id" = ?  [["id", 2]]
---
  def destroy
    @calendar.destroy!

INSERT INTO "calendar_days" ("date", "calendar_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["date", "2023-01-01"], ["calendar_id", 3], ["created_at", "2024-08-06 22:57:19.659122"], ["updated_at", "2024-08-06 22:57:19.659122"]]
---
  def populate_days(year)
    start_date = Date.new(year, 1, 1)
    end_date = Date.new(year, 12, 31)

    (start_date..end_date).each do |date|
      CalendarDay.create(date: date, calendar_id: @calendar.id)

SELECT "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_calendar
      @calendar = Calendar.find(params[:id])