app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "birth_date", "plan", "groups", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

UPDATE "clients" SET "plan" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["plan", "1x na Semana"], ["updated_at", "2024-08-08 00:09:23.377894"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @client.update(client_params)