app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)
    if @employee.save
---
INSERT INTO "employees" ("name", "position", "admition", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Gabrielly Fujisawa Lima"], ["position", "Estagiária"], ["admition", "2006-11-29"], ["created_at", "2024-08-13 23:28:54.646751"], ["updated_at", "2024-08-13 23:28:54.646751"]]

  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "employees" SET "position" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["position", "Professor"], ["updated_at", "2024-08-13 23:29:16.686719"], ["id", 2]]