app/controllers/groups_controller.rb

SELECT "clients".* FROM "clients" WHERE 1=1
---
  def show
    @available_clients = Client.all

UPDATE "groups" SET "updated_at" = ?, "professor_titular_id" = ? WHERE "groups"."id" = ?  [["updated_at", "2024-08-13 23:33:54.275281"], ["professor_titular_id", 3], ["id", 5]]
---
  def update
    if @group.update(group_params)

SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def enroll
    client = Client.find(params[:client_id])