app/controllers/home_controller.rb

SELECT "slots".* FROM "slots"
---
  def index
    @slots = Slot.all