app/controllers/home_controller.rb

  def index
    @turmas = Turma.all
---
SELECT "turmas".* FROM "turmas"