app/controllers/plans_controller.rb

  def create
    @plan = Plan.new(plan_params)

    respond_to do |format|
      if @plan.save
---
INSERT INTO "plans" ("name", "frequency", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Livre"], ["frequency", "Livre"], ["description", "Plano mensal livre "], ["created_at", "2024-08-14 00:10:49.205576"], ["updated_at", "2024-08-14 00:10:49.205576"]]

  def update
    respond_to do |format|
      if @plan.update(plan_params)
---
UPDATE "plans" SET "frequency" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["frequency", "1 vez por semana"], ["updated_at", "2024-08-20 21:58:45.245006"], ["id", 2]]