app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "created_at", "updated_at", "price_cents", "price_currency") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    if @product.save

UPDATE "products" SET "updated_at" = ?, "price" = ? WHERE "products"."id" = ?  [["updated_at", "2024-08-10 14:52:23.126573"], ["price", 95.0], ["id", 4]]
---
  def update
    if @product.update(product_params)