app/controllers/slots_controller.rb

SELECT "slots".* FROM "slots"
---
  def index
    @slots = Slot.all

SELECT "slots".* FROM "slots" WHERE "slots"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @slot = Slot.find(params[:id])