app/controllers/turmas_controller.rb

  def index
    @turmas = Turma.all
---
SELECT "turmas".* FROM "turmas"

  def show
    @turma = Turma.find(params[:id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @turma = Turma.new(turma_params)
    @turma.semanal_id = 1 # Definindo o valor default para semanal

    if @turma.save
---
INSERT INTO "turmas" ("dia_da_semana", "horario", "created_at", "updated_at", "faixa_etaria", "modalidade", "semanal_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def edit
    @turma = Turma.find(params[:id])
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @turma = Turma.find(params[:id])
    if @turma.update(turma_params)
---
SELECT "turmas".* FROM "turmas" WHERE "turmas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "turmas" SET "horario" = ?, "updated_at" = ?, "faixa_etaria" = ? WHERE "turmas"."id" = ?  [["horario", "14:00"], ["updated_at", "2024-07-31 22:59:41.888928"], ["faixa_etaria", "Teens"], ["id", 3]]